// Lab2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <bitset>
const int TEXT_LENGTH = 128;
using namespace std;

//Варіант 6. Завдання 1.
//Задано цілі числа a, b, c та d. Обчислити вираз без використання операцій множення та ділення(замінивши на їх операцій зсувів).
//33 * b + (d * 15 + 12 * a) / 512 - (65 * c) + (d * 14)

/*b + b * 32 + (d * 16 - d + a * 16 - a * 4) / (512) - (c + c * 64) + (d * 16 - d * 2)*/
/*b + b * 2^5 + (d * 2^4 - d + a * 2^4 -a * 2^2) / (2^9) - (c + c * 2^6) + (d * 2^4 - d * 2)*/
void Task1() {
    int a, b, c, d, x, y, z;

    cout << "Please enter a, b, c, d : ";
    cin >> a >> b >> c >> d;

    cout << "Your answer is: " << endl;
    cout << "a = " << a << "; b = " << b << "; c = " << c << "; d = " << d << endl;

    x = b + (b << 5) + (((d << 4) - d + (a << 4) - (a << 2)) >> 9) - (c + (c << 6)) + ((d << 4) - (d << 1));
    y = 33 * b + (d * 15 + 12 * a) / 512 - (65 * c) + (d * 14);

    cout << "x : " << x << endl;
    cout << "y : " << y << endl;
}

//Задано текст до 128 символів. Доповнити пробілами до 128 символів. Шифрувати тексти таким чином, щоб кожний символ тексту записувався 
//у два байти. Два байти мають таку структуру :
// 
// 0 біт – біт парності(1 біт)
// у бітах 1 - 8 ASCII - код букви(8 біт),
// у бітах 9 - 15 позиція букви у рядку(7 біти)
void Task2() {
    char S[128], c[128];
    unsigned short Rez[128];
    unsigned short i, j, r, w, t, b;
    for (i = 0; i < 128; i++) {
        cin.get(c, 128);
        if (c[i] == NULL) {
            c[i] = ' ';
        }
        S[i] = c[i];
    }
    for (i = 0; i < 128; i++) {
        r = S[i];
        w = i;
        w <<= 8;
        r |= w;
        t = 1;
        b = 0;
        for (j = 0; j < 128; j++) {
            if (r & t) {
                if (b == 0) { b = 1; }
                else { b = 0; }
            }
            t <<= 1;
        }
        r <<= 1;
        r |= b;
        if (b == 1) { r |= 1; }
        Rez[i] = r;
    }
    for (i = 0; i < 128; i++) {
        std::bitset<16> x(Rez[i]);
        cout << x << endl;
    }

}

int main()
{
    cout << "Please enter the text" << endl;
    Task2();
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
